# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.
#var 1
# s = int(input('введите сумму чисел'))
# p = int(input('введите произведение чисел'))
# for x in range(1, 1001):
#     y = s - x
#     if x <= y and x * y == p:
#         print(x, y)
#         #break
#
#     else:
#         print('неверные значения')
#         break
#var 2
s = int(input('введите сумму чисел'))
p = int(input('введите произведение чисел'))
x = (s-int((s**2-4*p)**0.5))//2
y = (s+int((s**2-4*p)**0.5))//2
print(x, y)

    # print('неверные значения')
    #
    #  else:

